apilogs.txt

<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns2="http://oracle.e1.bssv.JP420000/"><env:Header><ns1:Security><ns1:UsernameToken><ns1:Username>WPSTORES</ns1:Username><ns1:Password>tracyripon</ns1:Password></ns1:UsernameToken></ns1:Security></env:Header>   <env:Body>
    <ns2:processSalesOrderV4>
    <header>
    <businessUnit>17</businessUnit>
    <customerPO>23243422421</customerPO>
        <detail>
            <businessUnit>03</businessUnit>
            <processing>
                <actionType>A</actionType>
            </processing>
            <product>
                <item>
            <itemProduct>P12281-02</itemProduct>
                </item>
            </product>
            <quantityOrdered>1</quantityOrdered>
            <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
            <reference>61978</reference>
        </detail><orderTakenBy>WEBSAMPLE</orderTakenBy>
    <orderedBy>Dhiraj S S</orderedBy>
    <processing>
        <actionType>A</actionType>
        <processingVersion>TWG420023</processingVersion>
    </processing>
    <attachmentText>This is test order. Please do not ship.</attachmentText>
    <dateRequested>2024-03-05T00:00:00</dateRequested>
    <shipTo>
        <mailingName>Dhiraj Suthar</mailingName>
        <addressLine1>4596 S Tracy Blvd</addressLine1>
        <addressLine2></addressLine2>
        <addressLine4>04049379801</addressLine4>
        <city>tracy</city>
        <countryCode>US</countryCode>
        <countyCode>US</countyCode>
        <customer>
            <entityId>512444</entityId>
        </customer>
        <postalCode>95377</postalCode>
        <stateCode>CA</stateCode>
    </shipTo><soldTo>
        <mailingName>Dhiraj Suthar</mailingName>
        <addressLine1>4596 S Tracy Blvd</addressLine1>
        <addressLine2></addressLine2>
        <addressLine4>04049379801</addressLine4>
        <city>tracy</city>
        <countryCode>US</countryCode>
        <countyCode>US</countyCode>
        <customer>
            <entityId>510674</entityId>
        </customer>
        <postalCode>95377</postalCode>
        <stateCode>CA</stateCode>
    </soldTo ></header>
    </ns2:processSalesOrderV4>
    </env:Body></env:Envelope>
==============
